# Dealing with duplicates

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A': [1, 2, 2, 3, 4, 5, 5],
    'B': ['a', 'b', 'b', 'c', 'd', 'e', 'e'],
    'C': [100, 200, 200, 300, 400, 500, 500]
})

In [3]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
df [ df.duplicated()]

   A  B    C
2  2  b  200
6  5  e  500

In [5]:
# keep first occurence

df_drop_duplicated = df.drop_duplicates()
df_drop_duplicated

   A  B    C
0  1  a  100
1  2  b  200
3  3  c  300
4  4  d  400
5  5  e  500

In [6]:
# keep last occurence

df_drop_duplicated_last = df.drop_duplicates(keep = 'last')
df_drop_duplicated

   A  B    C
0  1  a  100
1  2  b  200
3  3  c  300
4  4  d  400
5  5  e  500

In [7]:
df_drop_duplicated_specified_column = df.drop_duplicates(subset = ['A' , 'B'])

df_drop_duplicated_specified_column

   A  B    C
0  1  a  100
1  2  b  200
3  3  c  300
4  4  d  400
5  5  e  500